espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc32xx/kernel/tirtos7/packages/ti/sysbios/knl/Queue_defs.h
/*
 * Copyright (c) 2020, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*
 * ======== Queue_defs.h ========
 */

/* @cond LONG_NAMES */

#ifdef ti_sysbios_knl_Queue_long_names

#define Queue_Instance ti_sysbios_knl_Queue_Instance
#define Queue_Handle ti_sysbios_knl_Queue_Handle
#define Queue_Module ti_sysbios_knl_Queue_Module
#define Queue_Object ti_sysbios_knl_Queue_Object
#define Queue_Struct ti_sysbios_knl_Queue_Struct
#define Queue_Elem ti_sysbios_knl_Queue_Elem
#define Queue_Instance_State ti_sysbios_knl_Queue_Instance_State
#define Queue_Params ti_sysbios_knl_Queue_Params
#define Queue_elemClear ti_sysbios_knl_Queue_elemClear
#define Queue_insert ti_sysbios_knl_Queue_insert
#define Queue_next ti_sysbios_knl_Queue_next
#define Queue_prev ti_sysbios_knl_Queue_prev
#define Queue_remove ti_sysbios_knl_Queue_remove
#define Queue_isQueued ti_sysbios_knl_Queue_isQueued
#define Queue_dequeue ti_sysbios_knl_Queue_dequeue
#define Queue_empty ti_sysbios_knl_Queue_empty
#define Queue_enqueue ti_sysbios_knl_Queue_enqueue
#define Queue_get ti_sysbios_knl_Queue_get
#define Queue_getTail ti_sysbios_knl_Queue_getTail
#define Queue_head ti_sysbios_knl_Queue_head
#define Queue_put ti_sysbios_knl_Queue_put
#define Queue_putHead ti_sysbios_knl_Queue_putHead
#define Queue_Module_startup ti_sysbios_knl_Queue_Module_startup
#define Queue_Module_startupDone ti_sysbios_knl_Queue_Module_startupDone
#define Queue_construct ti_sysbios_knl_Queue_construct
#define Queue_create ti_sysbios_knl_Queue_create
#define Queue_handle ti_sysbios_knl_Queue_handle
#define Queue_struct ti_sysbios_knl_Queue_struct
#define Queue_Instance_init ti_sysbios_knl_Queue_Instance_init
#define Queue_Object_count ti_sysbios_knl_Queue_Object_count
#define Queue_Object_get ti_sysbios_knl_Queue_Object_get
#define Queue_Object_first ti_sysbios_knl_Queue_Object_first
#define Queue_Object_next ti_sysbios_knl_Queue_Object_next
#define Queue_Object_sizeof ti_sysbios_knl_Queue_Object_sizeof
#define Queue_Params_init ti_sysbios_knl_Queue_Params_init
#define Queue_delete ti_sysbios_knl_Queue_delete
#define Queue_destruct ti_sysbios_knl_Queue_destruct
#define Queue_Params_default ti_sysbios_knl_Queue_Params_default

#endif

#if defined(ti_sysbios_knl_Queue__nolocalnames) && !defined(ti_sysbios_knl_Queue_long_names)

#undef Queue_Instance
#undef Queue_Handle
#undef Queue_Module
#undef Queue_Object
#undef Queue_Struct
#undef Queue_Elem
#undef Queue_Instance_State
#undef Queue_Params
#undef Queue_elemClear
#undef Queue_insert
#undef Queue_next
#undef Queue_prev
#undef Queue_remove
#undef Queue_isQueued
#undef Queue_dequeue
#undef Queue_empty
#undef Queue_enqueue
#undef Queue_get
#undef Queue_getTail
#undef Queue_head
#undef Queue_put
#undef Queue_putHead
#undef Queue_Module_startup
#undef Queue_Module_startupDone
#undef Queue_construct
#undef Queue_create
#undef Queue_handle
#undef Queue_struct
#undef Queue_Instance_init
#undef Queue_Object_count
#undef Queue_Object_get
#undef Queue_Object_first
#undef Queue_Object_next
#undef Queue_Object_sizeof
#undef Queue_Params_init
#undef Queue_delete
#undef Queue_destruct
#undef Queue_Params_default

#endif

/* @endcond */
